In [18]:
import seaborn as sns
df=sns.load_dataset('titanic')

In [19]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [20]:
##['sex','embarked','alone','pclass','Survived']
df=df[['sex','embarked','alone','pclass','survived']]
df.head()

      sex embarked  alone  pclass  survived
0    male        S  False       3         0
1  female        C  False       1         1
2  female        S   True       3         1
3  female        S  False       1         1
4    male        S   True       3         0

In [21]:
df['sex']=np.where(df['sex']=="male",1,0)
df.head()

   sex embarked  alone  pclass  survived
0    1        S  False       3         0
1    0        C  False       1         1
2    0        S   True       3         1
3    0        S  False       1         1
4    1        S   True       3         0

In [22]:
import numpy as np
### let's perform label encoding on embarked
ordinal_label = {k: i for i, k in enumerate(df['embarked'].unique(), 0)}
df['embarked'] = df['embarked'].map(ordinal_label)

In [23]:
### let's perform label encoding on alone
df['alone']=np.where(df['alone']==True,1,0)

In [24]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(df[['sex','embarked','alone','pclass']],
                                              df['survived'],test_size=0.3,random_state=100)

In [25]:
from sklearn.feature_selection import chi2
f_p_values=chi2(X_train,y_train)

## chi score gives two values - f score and p score.
- first value in the array is the f score - higher the value of the f score, more imp is the feature
- p value -> lesser p value, more imp is the feature

In [28]:
f_p_values

(array([65.67929505,  7.55053653, 10.88471585, 21.97994154]),
 array([5.30603805e-16, 5.99922095e-03, 9.69610546e-04, 2.75514881e-06]))

In [36]:
import pandas as pd 
p_values = pd.Series(f_p_values[1])
p_values.index = X_train.columns 
p_values.sort_values(ascending=True)

sex         5.306038e-16
pclass      2.755149e-06
alone       9.696105e-04
embarked    5.999221e-03
dtype: float64

### here, you can see from p values ascending = True and f_values ascending = False, sex is the most imp, followed by p class, alone and then lastly embarked

In [38]:
f_values = pd.Series(f_p_values[0])
f_values.index = X_train.columns
f_values.sort_values(ascending=False)

sex         65.679295
pclass      21.979942
alone       10.884716
embarked     7.550537
dtype: float64